{"review_id":{"7336":"9XnsAH64qS9yb3p2o8KWHA","11553":"Lh3rW7Tsur2sXEdgtmWRlg","4131":"BPHuSJP_PiFuK7nvAU7smA","11496":"UKFdLzqUKgqxLjlrRTN43g","10728":"Z_tpD6mg3FcPFoZqxyOksw","3164":"Y8HFdxglAupSehcYncJ-pA","12609":"1GYat4anQVbdIBzlCHWCZQ","6538":"LA7Vck2Luq9720OvVVkvGQ","14291":"KKMgR_GlTqAko1-ZVGvIEg","2032":"31YChdWDuKsON854ca5D9Q","5989":"y40-RU5Xfp6bkwsVJHyvyQ","1755":"OJcIcir8Tjs0KBpgAGBMaA","3682":"-zH5ZCUv5eEE2jePpdst7g","6077":"TLcKfOly0Yb2IMAk2VQvtg","4556":"X1dQPZ9HUef89cdHzXGAXg","7923":"TmcG53TMWOvzZRdUgSZF4w","3421":"I0uPj9Fd4Xugcc5V8KYVBA","13209":"aVGhObNLtv9-_5n7vWnl7g","13481":"bkVWuCQJ3rPDSYm_EMBv6A","1478":"7cCiL30lXNt2uS6-o3574w","4789":"QDbykInukbExUzyoUexXYQ","6238":"AtvcnF_WxYLEBenHK8KqYA","1544":"0PbV9F-XFW1AXJY3yyvUxQ","2413":"WR1CljpRK3rVnp2Pr9Vr8A","9565":"H3yIdMkQTQXVskQOXVvmdQ","2308":"aCvC-EIb1Gk64Sf4PBOlCg","8409":"yHjByeFaTqCOxz3Ut5eVpg","769":"ZQE9Kt1wq1wn2r7QLOJ3AQ","882":"fynaATdjkecdIDl6pGdGKA","5824":"coO_1yvKDshBeRE_FoMgXQ","13743":"cdktoe7Vfzds8FDmuLkZ0Q","7627":"3hm-gKIzfmmiJ88DXomoRw","10847":"vrTAMOR1hSvdg8B9A-8G4Q","12662":"INAzYDdKEewxXvhPcsaDWw","13248":"NFz5tsxhuM1ydqwmp7jgoQ","9203":"pOVui-8U1Ux5duB0e1W_5Q","1884":"t4maJf9So5NdAjTxY6d0fQ","677":"Ajzgqia8h58U1gVEvajPew","8810":"-Zj-xolo-XBdvCQOX7eE4g","1298":"lmajdTTY3TQ1NLClJ38icw","15051":"INRb51d9ves8mNgY49bJDA","6949":"xZf_NaWm3PQboFTsXjDH7A","1589":"F_Y2Yrm3QebbkMEemRn2zg","5082":"DvTDprlLQ4nSCmGFMu08ZA","6932":"tT8eUzfSZ4givBh1zxQe4g","3568":"jLmOETEbJaWR9ts5fo8i1A","12667":"ht7sFUgQFPWPBayuAGXtgQ","12469":"3zIIHMC4rn1wCDynJJASrw","6793":"ke32TX-aK2-_1wqrwpjfKQ","7726":"9AKKXR4Jhr40Sy4TMBJawQ"},"user_id":{"7336":"gcIQ4e1kgxC6a80Nb3GMDQ","11553":"5pJDDmpv6LgIEQD6rhMHPA","4131":"0o2K9yrsh6LOntzFlPiBKA","11496":"iigFQG_vi68kF_qnyMARaQ","10728":"AArhVXFj0Su5EfngmyGPyg","3164":"91qLUJP_nljeOi8G4uQzWw","12609":"aYz7yCK598WbOqyFgrYpDw","6538":"2xhndq3P25DZvlSdHgJUgw","14291":"OZR58zI5EzOfpS_qnhniug","2032":"NZZcXBz2vtYieSyzY28HmA","5989":"y0jYBMjwL6tjitsV_H8HoA","1755":"5IHZFbqYDXGJ00QlyUMPUQ","3682":"j8FPEI84GQup2VN_0ngrQw","6077":"EFF-1ep0RzCw7zzZA0bEkw","4556":"Mjr1MbDqNPNafh8g-s7WSg","7923":"qQecSd0lynfB4g-LPa9JCw","3421":"GsAAQtmwfdm_Y4DBcVVGXQ","13209":"recyBFX5RainKFFKGtT8fg","13481":"Pa63EpsYtkpHHItrjU6HcQ","1478":"2v38YzoFeOjeRy4O92d2tw","4789":"tKTEEc0yiLsg1vU8cVKGVw","6238":"1eXBL1OC7Zv3jF9SNrQg6Q","1544":"V4D4x4QtDB-tmXkwdxgwDA","2413":"lCQ-2TSe8E9rxZxd65Se4w","9565":"4Wh3j1dXt2J82bbzi3QCgw","2308":"F0BFl-eZcc1O3rl7RxSykA","8409":"s6FfMrvpP71MUCvCnke61g","769":"RYa1fWYn7B_bz_HGNXlvsQ","882":"AMui7zsm0hfNrwV4GrN1vQ","5824":"ffwhYXKfYwzH-_HHYBYHtA","13743":"heqV8fuYyjDCyRHp9GFmlw","7627":"WhVjKR-UbHq6jrj0Akla7w","10847":"lyxcBgfBzmXjfcmdQshU5Q","12662":"DkbNXoLTlmxWAODpe_2B6Q","13248":"kC4kfNQPGL0MtERXdbdv-w","9203":"MbBhClrXyu8-Mk5wW5y8tg","1884":"jkG56PsoRkZm6PhE8MJJdA","677":"9cwC-zXHHCu9Pjn3310smw","8810":"RDlBchULK50ur7BNGHtjew","1298":"O6VJllS1W_l69HJcFLLieQ","15051":"hMYEwWtfEHcYmDr6squCnA","6949":"0rHbZl0zwGreOyB-gHOa2A","1589":"8JQ4D-jYUkuckSMtrlEYAg","5082":"kLQ8j_gtH6cazxaZIucHPQ","6932":"zk_jRRte9Fu_8bEy-AF-JA","3568":"METbZC5f659pJol53SSyJg","12667":"FJBujph2sgryNCd7EItcTg","12469":"NWrecl5hjADiE3eRt-8jjA","6793":"kUeLEDZpZFN0Wq0nF5Mk0Q","7726":"7mj8c0cAlMtJIKK-dw6_Uw"},"business_id":{"7336":"IeK0nzbMPbWnUBIPB83v6A","11553":"QaFO4S6HFUu2NIbeu4OwCg","4131":"IUMyUYOIR9UQ7XGIEQKOuA","11496":"d8Kz48UDfZ0MPuQpGy2r0Q","10728":"i-2OzvZUDtvKCMq1vcRSZg","3164":"S6apFS5ghsQg69rcBvm2Qg","12609":"QqGMtc24VdCzYAajw1g4bA","6538":"YgWGWza3sXzI0brcOogR5A","14291":"AT-og6IROn0hJt-HR5Njlw","2032":"Mx8jCUdhaNbMgx_04DWHdA","5989":"ih_bb1SaYvsMYfdykhYh2g","1755":"z8Em-bhZI3Mmspml7tj6tg","3682":"NRAmrbIGgXgH5uYv8GGJ5A","6077":"c0t81YxNqZQuTJrTfn3QYA","4556":"kAmNIcJpAZIZIp5uSMAYLA","7923":"y5fwt6pAKnvYOSn-xOUepA","3421":"R4EhR8xhONLFqqI6ZnzNWw","13209":"s7keQ0-OQ5Li_IKGKVTarw","13481":"qMyYY8zpHusOXUd6wmqX2w","1478":"vuHzLZ7nAeT-EiecOkS5Og","4789":"yAkaDc6MWX3dy8bnEcCrRQ","6238":"R4R7ttLXfKKWM0VEMoaW4w","1544":"7e3PZzUpG5FYOTGt3O3ePA","2413":"sWh-N7K3ebRHZKhhH01mJQ","9565":"QxRKQ_Lzu4lMOejwVgcdAg","2308":"paCgjLEUEVM38VZ6Sjghgg","8409":"AT5NZHqoLeP4rhWMM2OWBA","769":"4tjKsIaBXCDUP9PL82Vu_A","882":"a4GRh1TlOVhPD401mSPLZg","5824":"aDHD7nASfqiQBB6YXy2aGA","13743":"mSqR24h_nKXyMhwtWSih3Q","7627":"8Z72HW5ydzQFydUxZglurg","10847":"ZP7U4qUCMjIvasWV7a_mgg","12662":"RyaCGkXRXxXNeJhbnioz1Q","13248":"shIPnFoXrL3dFo5HLH1_HA","9203":"lOgybcjtSymXvJWvSZk1vw","1884":"rubyBEGXLBLU_JAuEtKEuw","677":"QeEQXdto_4wFRaNKyIygRA","8810":"dOgvND5x_MKMBkqI3GvZXA","1298":"l07ctcrDMV--TYwe3uzebQ","15051":"vMpJzMFst_9GP4boeqWIRg","6949":"JiNtFt02pLvjXkqxZL737Q","1589":"wPgp3oddFUzpGrQc__HYhg","5082":"NnxwkiBvSSyKeFiez0DDcQ","6932":"sj9osyqLyOy7b_kDZb1txA","3568":"1Fpk8ibHhZYnCw8fnGny8w","12667":"IzcL0KZPKqMbjoIaCmClog","12469":"uhyDNWYRSsom3VrFgOgP_w","6793":"cOY6ipigtTXdcmmmiFiniA","7726":"3kUqNxO1rkDDb89GAfyNgw"},"stars":{"7336":1,"11553":1,"4131":1,"11496":1,"10728":1,"3164":1,"12609":1,"6538":1,"14291":1,"2032":1,"5989":1,"1755":1,"3682":1,"6077":1,"4556":1,"7923":1,"3421":1,"13209":1,"13481":1,"1478":1,"4789":1,"6238":1,"1544":1,"2413":1,"9565":1,"2308":1,"8409":1,"769":1,"882":1,"5824":1,"13743":1,"7627":1,"10847":1,"12662":1,"13248":1,"9203":1,"1884":1,"677":1,"8810":1,"1298":1,"15051":1,"6949":1,"1589":1,"5082":1,"6932":1,"3568":1,"12667":1,"12469":1,"6793":1,"7726":1},"useful":{"7336":0,"11553":1,"4131":3,"11496":0,"10728":0,"3164":0,"12609":1,"6538":1,"14291":1,"2032":3,"5989":4,"1755":2,"3682":0,"6077":2,"4556":4,"7923":1,"3421":1,"13209":8,"13481":0,"1478":5,"4789":0,"6238":1,"1544":0,"2413":1,"9565":0,"2308":2,"8409":2,"769":1,"882":4,"5824":0,"13743":1,"7627":0,"10847":2,"12662":0,"13248":2,"9203":3,"1884":3,"677":0,"8810":0,"1298":0,"15051":0,"6949":1,"1589":1,"5082":3,"6932":0,"3568":0,"12667":4,"12469":5,"6793":0,"7726":4},"funny":{"7336":0,"11553":0,"4131":0,"11496":0,"10728":0,"3164":0,"12609":2,"6538":0,"14291":4,"2032":0,"5989":3,"1755":0,"3682":0,"6077":0,"4556":0,"7923":0,"3421":0,"13209":20,"13481":0,"1478":1,"4789":0,"6238":0,"1544":0,"2413":0,"9565":0,"2308":2,"8409":0,"769":0,"882":2,"5824":0,"13743":0,"7627":1,"10847":0,"12662":0,"13248":0,"9203":0,"1884":2,"677":1,"8810":0,"1298":0,"15051":0,"6949":1,"1589":0,"5082":0,"6932":0,"3568":0,"12667":4,"12469":2,"6793":0,"7726":0},"cool":{"7336":0,"11553":0,"4131":1,"11496":0,"10728":0,"3164":0,"12609":1,"6538":1,"14291":0,"2032":0,"5989":0,"1755":1,"3682":0,"6077":0,"4556":0,"7923":0,"3421":0,"13209":6,"13481":0,"1478":2,"4789":0,"6238":0,"1544":0,"2413":0,"9565":0,"2308":0,"8409":0,"769":1,"882":0,"5824":0,"13743":1,"7627":0,"10847":0,"12662":0,"13248":0,"9203":1,"1884":0,"677":0,"8810":0,"1298":0,"15051":0,"6949":0,"1589":0,"5082":0,"6932":0,"3568":0,"12667":0,"12469":1,"6793":0,"7726":0},"text":{"7336":"Was really looking forward to checking out howl at the moon. I'd been to another location years ago. Singers tonight were terrible, I've heard better karaoke... Left before finishing overpriced drinks.","11553":"Chase not only didn't listen to the things that we had spoke. About like calling me with a price quote with oil change and or things that warrenty didn't cover. My tire needed to be changed because of a nail so he couldn't do my requested car diagnostics. Ok well I understand the policy of Mazda however I'm having a hard time financially and I bought a used tire and brought it with me and because of policy again he said his manager didn't. Allow a perfectly good tire to be replaced. I explained to him I'll go get it fix. He then ignored the go way and beyond policy you have and didn't even bother to try to make a new appointment . Actually he seemed aloof and disconnected that I only had the loaner washed and gassed up due to having it fmduring the weekend when your service department is closed on sundays. I did call and convey a message to the answering service the day he called and said that my car was done. Which is wasn't. I have the message voicemail. I left upset and unhappy! I not only didn't get my oil changed or the requested diagnostics handled in my vehicle . I completely felt obsolete and unimportant to not only the second car I purchased with Mazda but he didn't understand why I was upset. I went up and down trying to afford a tire and then the price of oil etc etc. I left to get the tire hanged but didn't return because I've been completely discouraged with this company not only with the service department but your core values! I'm so upset even writing this thing that when I purchased both cars I was given and told the impression that you. Your core values would be that of a satisfied customer. I'm UNHAPPY WITH CHASE IM UNHAPPY WITH MAZDA. Be ware people . I don't understand car functions but. Customer service I'm a pro at . With frustrated regards \nGuadalupe","4131":"The eggs I got at the express airport version were not at all the same I get in the restaurant. I ordered a lemonade and was given no choice in size.  So I paid nearly 5 dollars for a rather large (32 oz) cup. I accidentally knocked it over when picking my eggs up. I had only drank 1\/5 of the cup and asked if there was a refill price to replace the spilled lemonade and the employee said I'd need to pay full price. I was pretty astonished.","11496":"The view is amazing but the food is all crap. The wine is over priced and the food is nothing to write about. The Server did not even know how to carry plates or serve","10728":"I thought this place would be good. Had the Italian hoagie and noticed right away that the lunch meat was low grade !!!! TERRIBLE","3164":"Ordered online ... said my order would be ready at 9:30 ... came up to the cash register to pick up my order and guess what?  Didn't even bother to look at the online orders ... thanks Caps!!  Your the best ...!!! Third time this has happened ...","12609":"Wow.  Just called in for takeout.   Their response:  \"we are too busy. Not taking call ins today. Sorry\".    How about you staff accordingly?   What a way to ruin Father's Day jackasses.","6538":"DO NOT GO HERE! For 5 months my  wife and I went to Dr Dee for various services she recommended. We ended going at least twice a month. Our previous dentist never mentioned all the work Dr Dee wanted and said our teeth were fine. My wife's cousin said the same, but she's out of the area. But now our teeth were in need of several cleaning processes, cavities and root canal. She told me I needed an implant. My specifically asked about her root canal an the quality of the crown. She was assured everything would be high quality. About 8 months later she was eating spaghetti and said something is in her food. It turned out to be her crown. This was less than a year after putting it in. She went back to Dee and was told if she wanted a new one it would be $600. She said we both have crowns from the 80's which were fine and this one broke on spaghetti? She left and went to a different dentist who told the material in the crown was a very inferior material and was surprised anyone would use it. She got a new crown for $400, not $600. I also went to a dentist about my implant and was told the tooth had good roots, wasn't loose and said no implant was necessary. This place is all about the Benjamins. I was to say disappointed and my wife felt terrible as she felt we were taken advantage of. My wife had great hopes from Dr Dee..","14291":"We visited last Saturday night.  I have wanted to come here since I was a kid, always found the building to be intriguing.  Complimentary valet parking was nice, and the interior of the restaurant is really cool.  It's so old school, but remarkable with the carved wood and stained glass everywhere.  The lights were too bright though.  Reminded me of a well lit cafeteria.  \n\nThe service was OK.  It was weird how they were either all over us (rushing us, at certain points) or they were completely...gone.  The service, after we received our mains, was all of a sudden realllllly slow.   And then it became unbearably hot in there.  It wasn't just me, all four of us were actually sweating.  It just got hotter and hotter...\n\nI liked the relish tray.  The bread was really delicious and the pickles were nice and sharp.  I was insulted by the price of the caesar salad, so I didn't order it.  The profit margin on a caesar salad is already ridiculous, but they think they can charge $17.95 a person?  For lettuce, egg, parmesan and half an anchovy?  Ha, no.  Instead I had a caprese salad that was chincy on the cheese, had only 6 tomato slices and with 2 drops (literally) of balsamic.  I'm pretty sure it was like $20.  Probably should have just ordered the caesar..\n\nI then had a $60 steak that was honestly delicious.  it was cooked perfectly, well seasoned and juicy.  It arrived on a plate with two ugly, gray, wrinkly mushrooms.  Before I could inquire about my potatoes, they arrived on a side plate.  Ice-cream-scooped style.  Just like a cafeteria!  I inquired as to the whereabouts of my vegetables and was informed that veg is extra $..  I said fine and they brought me 3 pieces of broccoli and 6 carrots.  They were tasty and buttery.  May have been frozen. \n\nBasically, this place is a rip off.  The prices are atrocious.  And believe me, I knew the prices were high before I went there and  I honestly didn't care b\/c I assumed the food was good.  And while the steak was good, the rest of the food was laughable.  \n\nThis steakhouse is almost identical in menu, same relish tray, same room decor as Peter's in Markham.  Only, Peter's is such a better value and the food is WAY better.  I think I will stick with Peter's.","2032":"Bad. We walked into the dingy establishment and were greeted by silence from both staff members. After perusing the seemingly impressive menu I ordered onion rings and the burogie - a burger topped with coleslaw and a latke. The order was ready in a few minutes and served to me on a tray absent of paper lining. As there was no condiment station I asked for some ketchup for the onion rings and the lady behind the counter handed me the squeeze bottle of ketchup used for burger prep. I sat back down to dig into the food and was completely disappointed. The onion rings were OK but clearly purchased frozen from a manufacturer likened to McCain. And the other portion of the meal was the dry, lacklustre \"micro-burger\" ($10!), which I'm sure could have sat very comfortably in the palm of my hand given its size. A total ripoff. Overall, way too expensive for what you get (you can't charge average prices for subpar fare), and the ambiance was cramped and unfriendly, with employees completely detached from and inattentive towards the customers. I would say that this place may only potentially merit a visit (for takeout) during hours when the daily special offer is valid (2 for 1 burgers until 5pm), and only if you happened to be very close by. But I wouldn't return.","5989":"Invest in some wine glasses.. Not everyone is a craft beer drinker and drinking a glass of bad pinot out of what looks like a baby food jar didn't make me want to stay for another drink. The bartender had a nasty attitude and disappeared right after pouring my wine and sat in the back talking to a waitress the rest of my visit...horrible customer service skills..I was excited their was a place on my way home I could stop for a drink after work, but I won't be returning.","1755":"If I could give a big ZERO, I would. Last night my husband and I visited because we were craving BBQ. Usually we make the 30 minute drive to Chandler to go to Rudy's BBQ which is from Texas, but last night we were too tired. I ordered the brisket. It was grey and absolutely dry. The spicy beans were cold and the food plainly... sucked. My husband ordered their chicken sandwich. It was nothing special. A couple chopped up chicken pieces and bbq sauce. Totally disappointing!! I can not understand how this place stays in business, If you want GREAT BBQ, go to Rudys!!!!!!","3682":"Overpriced and average. It's been awhile since I went in, so maybe things have changed. Long story short, quality is not the first priority. I was also asked to leave a good yelp review last time in exchange for a lighter tab, but wasn't on the platform then. Wouldn't change anything for me and I find it incredibly sad of them to even ask. More of a morals review here, but I just can't support a place that is both average and desperate. Better places in the town to eat in my opinion.","6077":"Don't take your car here!  They broke my one month car and said all well.  The store manager didnt even care or say one thing to me.  I was standing right in front of him","4556":"I called right away to the staff and they told me how they were on lunch. Even if they were on lunch it should of been taken care of before. Trash is constantly flying around this place. Pictures don't lie","7923":"I got here at 4pm on a weekday in Dec 2006 and maybe I had the skeleton staff because service really sucked ass. No smile. No checking back. Wrong orders. You gotta be kidding me.\n\nThe gazpacho was good but not extraordinary and to my surprise, the waiter didn't even know what kind of olives I was being served. The sangria was good but... honestly... my glass was more ICE than it was DRINK.\n\nSo sad because 4 years ago I ate at Babareeba in Chicago and had such an amazing experience. Fun, lively, great food, and very knowledgeable waitstaff. I talked about it for the following week!\n\nGoing into the Las Vegas restaurant and asking a simple question about what kind of olives are in the olive appetizer and getting a blank stare as an answer was just the beginning of a disappointing experience.","3421":"I use yelp all the time to find restaurants but have never posted before. My experience at dumpling restaurant was so bad that I finally signed up to share what happened. \n\nFirst off, entering the restaurant, the manager is at the counter on the phone, and doesn't even look up to acknowledge the guests as they enter. \n\nOur server was typical for this type of establishment, so no issue there. \n\nWe ordered 5 items for our family, 2 of which were actually decent. But 1 item was so off putting that the rest didn't really matter, and here's why. We ordered the pork and pickled Cabbage dumpling and was appalled after just 1 bite. It was foul. It left a garbage taste lingering in our mouths that we couldn't get rid of (imagine the smell of stinky tofu, but in your mouth). We waved down the waitress to let her know and she said that's how pickled Cabbage tastes like and walked away... Really? The many other dumpling houses in scarborough\/Markham certainly don't taste like garbage or over fermentation. \n\nI'd like to extend an offer to this waitress and the owner to try the 2 other dumpling houses just beside them and tell me that, that's how pickled Cabbage is supposed to taste like. \n\nIT'S NOT SUPPOSED TO TASTE OR SMELL LIKE GARBAGE! \n\nAfter taking that 1 bite, we just lost our appetites and asked for the bill. When the waitress came to our table to collect our money, she didn't even bother saying anything to us about the 13.5 out of 14 pcs of dumplings left untouched at our table. \n\nThere are literally 5 dumpling houses within 5 minutes of this property. Do yourself a favour and venture into one of those.","13209":"The man who did my pedicure was focused on talking to another woman in the salon and proceeded to rub my heel raw, causing a lot of pain and some blood. \n\nI'm also pretty positive that he made a racist comment about black people, to the woman next to me. Completely unacceptable. \n\nI don't believe that this sort of service is characteristic of this salon, but I can guarantee that I will not financially support an establishment that is tolerant of racist customer service. Perhaps I misunderstood his comment, but I think I would be lying to myself if I convinced myself that it wasn't actually a racist comment.\n\nEDIT: after calling the salon on the phone the next day and speaking to a manager, I was reimbursed for the pedicure I received. Much appreciated.","13481":"Be careful, if you have germany car , this company do my audi A4, they broke my mirror (inside ) the car, but after the day i installed , they said they didnt touch anything,even they 're not done doing it, the guy said \"please sigb in in yelp and make sure put 5 star, so you can get a discount!!!! Be aware Ok!!!!","1478":"Pros: Started our services with AP approx 2 1\/2 years ago as they were scheduled through our home warranty. No issues with the fix or warranty, so we started weekly pool service on our very simple play pool. \n\nCons: High turn over, poor customer service on the phone or in person - example: said the tech was at our house on Friday at 237pm, as u can see in our picture taken at 4pm, no baskets were cleaned. And on a Seperate occassion, i mentioned to the tech that our system was showing \"low salt\". He said he would take care of it, i watched him put chemicals into the pool and within 24 hours our pool was dark swampy green. Because our service was on fridays they did not come back out until Monday AFTERNOON to take a look at our pool that their person turned green. They did clean our salt cell and we had to run our pump for 72 hours straight to rectify the green pool. Aka: high electricity bill that month. \n\nOverall, if you actually see a tech show up they are here for less than 5 minutes, never the same one, dont complete the tasks they advertise for $80\/month and you will be disappointed by the customer service you recieve when you call the office. We gave them a valiant effort & thousands of dollars but HIGHLY HIGHLY do NOT recommend & its time to move on.\n*** if below comment from Mike is referring to our call with the secretary Monday morning it was anything but pleasant considering how long we've  been customers.. snarky & disappointing was more like it & the only discount offered was to not pay for last week when the tech clearly either no-showed or did nothing at our house**","4789":"Thoroughly mediocre Chinese food. Could have gotten the same thing from a random mall food court.","6238":"We went to yogurtology one evening for a quick yogurt to-go, we had a full ten minutes before they closed. When we went in they were finishing mopping the floors, the toppings were all put away , and the yogurt machines turned off. We found it so unprofessional for them to close everything before they were actually closed. The workers looked at us as if we were supposed to just turn around and leave. We proceeded to get yogurt and they had to bring out the toppings we wanted and it was terribly awkward. I give it a one star for bad service and mediocre yogurt.","1544":"Had Dinner there. Bill of two for an Appetizer - 2 steaks - No Dessert - and 2 Glasses of house wine came to $ 111. Waiter was serving a very large party so our service was sporadic. Steaks ordered Medium and Medium Well. Both steaks arrived on the rare side. Sent one steak back - when we saw it again it was charcoal black. This had to be done for spite - Manager would not come to the table until after the steak was removed and offered to comp the appetizer. Their Au-Gratin potatoes are boiled cubed potatoes covered in Cheese-Whiz. \nPoor Beef Quality, Service and Management.\nDon't Gamble your Dollars on this place.","2413":"My grandpa was admitted to this hospital last Tuesday and passed away there on Monday. We had a terrible experience and seeing the reviews horrify me... I wish he went to a different hospital but he had to go here since the other hospitals near his house were full. Now I'm beginning to think I know why this hospital was empty... I am deeply saddened by the loss of my grandpa but since the day we got there I can't help but think what could have been done differently if he went somewhere else. We were told by the RN that my grandpa probably wouldn't make it to hospice (meaning he wouldn't make the ride there) so it was best for him to stay at the hospital and pass. Yet the DOCTOR was pushing for him to go to hospice. His reasoning was because they needed to utilize the rooms in the ICU for other patients. I completely understand however we were told by the RN that if indeed there was another person in desperate need, we could just move him to a different room, out of the ICU. The doctor didn't agree. He said it's comforting and there is a priest at hospice. I told the DOCTOR that the RN didn't think he would make it to another facility and what his thoughts were. I asked him \"what do you think? Would he make it?\" The doctor replied, \"no there's a possibility he won't\" ok...... then why would we move my dying grandfather and make him suffer?!?!?! Our hearts are hurting enough... all we wanted was for him to pass away in peace surrounded by his loved ones, not in a van or ambulance. After the Dr left... the RN came in the room and asked what was just discussed. I explained everything to him in tears. The RN APOLOGIZED for that DOCTORS unprofessional behavior and said \"do not worry, your grandpa is not going anywhere\" the RN said you don't worry about what he said, you guys spend the time left you have with him. My grandma said he was an angel sent by God. I don't understand how a human being can be so selfless and cruel. He doesn't care about people. He clearly cared about his paycheck. I don't recommend coming here but if you have to I hope you don't see this Dr. I won't post his name because I don't feel that's right. My grandpa is gone and there's nothing that can change that. THANK YOU to all the amazing RNs in the ICU! It makes me cry just knowing you were genuinely there to help the people! We had a bad experience with one just one RN. My grandpa said he couldn't breathe and instead of listening to him she said \"you know what that means? I'm going to sedate you\" even though he was responsive and coherent enough to say NO! She didn't listen and shoved large pills down his throat when she was told he couldn't swallow big pills. She was told this and still did it. That was the last day I saw my grandpa awake and I didn't know that would be the last time we ever talked to him or saw him with his eyes opened. He said NO i do not want to be sedated, but she did it with no explanation. She treated him poorly. He was a person that deserved to be treated with respect. Rose, Collin and Jonathan, all you RNs were a breathe of fresh air and my family and I appreciate you so so so much.","9565":"After two subsequent visits we are giving this place thumbs down. Their steak sandwich' is nothing more than steak ums, piled with french fries (Pramanti's rip off), and lousy tasting overall. And for close to $9? I don't think so. 2nd visit: 'giant fish' sandwich had absolutely no flavor! Guiness beer on tap special was watered down. Wife had steak salad with wilty lettuce. Wrote to them and they told me nitrogen valve on the keg tap was faulty...maybe so but don't they taste test their tapped beer every day??? Seems like this should have been a protocol. Overall...so-so to lousy food, lack of quality control beers, noisy, crowded, and terrible to find parking. Never more.","2308":"This place draws 3rd rate comics and charges 1st rate prices. Absolute Comedy and Yuk Yuks are far superior options in Toronto. I wouldn't reccomend Comedy Bar to anyone looking for a good night out. Rivoli also has comedy nights which are a good option..","8409":"I had high hopes for this place, I was referred by a friend. I was quite disappointed by how small the pizzas were at $16 each- we needed four pizzas just for our family of 4.  And all four pizzas had too much sauce and not enough cheese. All the pizzas needed salt or other seasoning, they had no flavor.\nMy other issue was with ventilation. I hate walking into a restaurant and you can smell strong cooking odors. I felt like this place smelled very heavy of almost burning wood fire, so when I leave my hair reaks and i need a shower (ladies you know what i mean!)\nMy husband made a comment that people probably go there once to try it but then usually don't go back again. I agree.\nMost of the other people we saw there were just drinking beer and getting an appetizer.\nMuch better pizza places closer to mooresville!","769":"This Review is strictly represented to the Spa location in Litchfield Park at the Wigwam Resort.\nWhen I was done spending $170.00 later in services at the salon I was told the spa was open free with service. Never was I shown the facility or walked through the Spa, my daughter was with me having mother daughter time she is 17 years old. She also had nails done at the salon. The lady at the entry to the Spa was not helpful at all. I asked for a drink and I ordered a Gin and Tonic, 45 minuets later I asked about the drink I ordered and 15 minutes later the lady arrives at the jacuzzi that we just where getting out and done with my watered down drink and ice tea for my daughter. I simply did not complain but this type of treatment by your staff immediately set the ambience for the remainder of our stay which was short lived because after she handed me my drink she proceeds to ask me my daughters age? Why? Then proceeds to tell me that they do not allow underage in the Spa! I read on the sign by the jacuzzi no children under 16. So either she was just being plain mean and cruel and very unkind to a guest with her daughter and in my opinion should not be working in an Elizabeth Arden Spa environment or they failed to tell me that when I booked our Spa services. Because if that was the case I would of drove to a Spa I would of been welcomed and appreciated in. I will say this my hairstylist apologized for that woman's behavior but what happened to hiring people who care and actually like doing what they do.\nAnother bad part of the Spa was the bottom of the jacuzzi tore up my feet because it needs to be resurfaced, the sauna room smelt like mildew and it was all rusted out and gross. The eucalyptus was stained in the white wash rags sitting in cold water ice was melted maybe had 2 rags left. The towels to dry after shower smelled like dirty towels. And they ran out of them. I would not recommend this Spa in Litchfield Park @ the Wigwam. It was a very unpleasant experience for myself and my little girl.\nHappy Travels!","882":"I requested a consult which requires supplying personal information.  No big deal. Until you cancel your appointment and the harassment begins.  I have cancelled my appointment several times-email and telephone. They continue to blow up my email and text. Each time I received a text or email I again cancelled my appointment.  I do Not recommend giving any information to this company unless you are absolutely sure you wish to see it through. \nI have not seen or spoken to a doctor. After this ordeal I will not reschedule.","5824":"Got there an hour before closing and they had NO regular pretzels. PATHETIC! How can you be a pretzel shop and not have pretzels. Drove 30 minutes to get there and no pretzels, not cool.","13743":"It is a very bad experience. I came in today, but it took a while until someone greeted me, besides that, the drinks were super slow. I tried the smoothies and it was really sweet. I do not know what the put in the ingredients. Luckily, I was fine after drinking their smoothies. I won`t come back. Super slow and the drinks were just so so, nothing good.","7627":"Worst place ever for food service don't waste your time or money.The staff does not understand when you want something specific. The food was horrible main dishes were cold and sushi was hard and old. Hibachi grill wasn't very clean and the bathrooms smelled like hard urine. Please don't waste your money","10847":"I have been to many Waffle Houses before, but this one is gross. I had to get up and leave due to general lack of cleanliness. We sat down at a \"just cleaned\" table which still had a big smudge of syrup or jam on it, then we grabbed our menus which also had finger-smudged gunk all over them. I ordered an ice tea and the aftertaste of it was gross... it had been over-brewed. It was incredibly cold in there as well, which was totally unnecessary considering the temperature outside was in the 70's. Yet they had the AC on full blast and I was uncomfortably chilly. The final straw for me was when I saw a small group of flies buzzing around next to the window near my table... at first I didn't think anything of it; I thought they were outside the window. But then I noticed they were all actually inside, and if I can see that many flies right at my table, there must be quite a few roaming freely inside the restaurant. Overall lack of cleanliness made us get up and leave. I shall not come back to this particular Waffle House.","12662":"Wow.. never been to a slower Starbucks in my entire life!! No hustle whatsoever from 3 of the 4 employees working today.. if it weren't for Carlos who appeared to be the only one working, I wasn't sure if I'd ever get a coffee.\n\nGrande Mocha tasted like warm milk ta boot... Did I mention the music is playing too damn loud.\n\nGiving Starbucks a bad rap these people are.. won't be back.","13248":"My disappointing & frustrating experience here matches another recent review here... I asked for my brows to be cleaned up with just a slight arch maintained. The girl then proceed to remove nearly all my brows. To make matter worse, they were uneven. When I asked about trying to fix a very clear uneven spot, she said she couldn't do anymore since there wasn't enough left to work with... UH, YOU THINK?? Within two days, my brow area was broken out with little scabs that took several days to heal. I've had my brows threaded many times before, but never ever with such terrible results.","9203":"I've been here before they did the renovation and after they did it. The attitude here just completely changed after they did the renovation and the waiters think they are hot stuff and that you should be honored to be eating in there. Well. I went here with a couple of friends for lunch and requested a table where we could watch some tv. So of course they throw us somewhere where the view is terrible and I make them move us to another table. Oh. The place is not packed at all. It's about 1\/4 full. \n\nWell. We start looking over the menu and the smoke alarm starts beeping. Except that there is no smoke. So they just leave it and let it keep beeping. The noise got so annoying that I asked our waiter if he could do something about it. He looks at me and says \"What? You don't like our music?\" while continuing to stare me down after his smart ass remark. So of course I say, \"Ya. Very funny. Seriously. Unplug it like any normal person would do because there's obviously no f@#(*!g smoke.\" Yes. I am pissed. He gives me a look and walks away. The noise continues to beep and other customers are starting to complain. At this point, we've had enough and just leave.","1884":"Very bad service. Did not deliver what I ordered. When I let them know, I was treated extremely rude. Will never use this company again.","677":"Visited on Friday 3\/25 for supper. I was really looking forward to a good Cajun meal. Out of fish on a Friday????  Are you kididng? And, crab soup so salty, was not edible. The waitress, who was really good, did not charge for it after complaining. Rice and beans pretty good, and wait staff quite attentive. I really did expect better. Will not be going there again.","8810":"The staff makes you feel lucky to be there, and they are not welcoming at all. Beer is just okay, and when asked to sample the pumpkin beer, was told they would lose their job if they gave a sample. Wow. Not my typical experience in Pittsburgh. No need to revisit. Go to Blue Dust or Rock Bottom if you're in Homestead, they now how to treat their guests.","1298":"I order the sama BBQ beef that i always order last time. They only give me like half of the meat as usual. I do complain about it, and the girl just put the beef in chair n ignore me. And i ask again, she keep ignore me. WON'T COME AGAIN","15051":"We have visited this particular location 3 times and the service is just terrible. The staff is rude and arrogant. They may not be fluent in english but they can atleast be courteous and polite and greet with a smile. The light fixture above our table was covered with dust. Although the food is decent, the attitude of the staff compells me to not recommend this location. Poorly managed.\nI have been to Congee Queen near Steels and Woodbine and its far better in taste and service.","6949":"The food here stinks! I will never go back again! Don't waste your time and money there are other restaurants with better quality food!","1589":"Sad to say that this used be a place were I could get a awesome chocolate shake. Unfortunately when my husband and I got here we have to wait forever to order and to get our drinks . In addition, we have to get to the cashier to get the check.  We could hear the people in the kitchen laughing and joking .meanwhile ,the place had dirty dishes and no one to check us out.","5082":"Btw, it's been 2 years and never heard anything from corporate or the store. They just don't care about customer service. They have not address the issue of being profiled. At least have the courtesy to respond.","6932":"Wanted to try this place since it opened and finally got the chance. Extremely disappointed....canned mushrooms? Really? With a full service grocery store right behind you? Too pricey for canned ingredients. Save your money and your taste buds and go to Brooklyn V's across the street.","3568":"You don't come here for the food.  It is a beautiful restaurant with a pretty good vibe. Everything tastes the same. Spicy and dry. Ordered the empanadas. Very expensive. Very dry.  Service felt very corporate, I wouldn't have thought that would be the case. I felt like I was at a keg or cactus club. Also their space Pablo, should not be called that. Very insensitive to the latin community.","12667":"They have a rifle range that is only open 75 minutes per week.  Minutes, not hours.\n\nI've been trying for weeks to shoot here, but it just isn't possible.  It's public land controlled by an old boy's club.  So it's a great range you have already paid for with your tax dollars that you will never get to use.","12469":"I was craving some Falafels and i decided to stop in. It was empty, which is never a good sign. But i went for it anyways. I ordered the Chicken Shwarma(for my daughter) and the Falafel platters with half rice and half salad.  My food came out pretty fast and the presentation was promising. I took my food to go and as soon as i got to the car i could not help but to dig in. Everything, i mean everything was super bland. The rice, the falafels, the hummus......#blandasfuck. The only thing that had any hint of flavor was the tzatziki sauce. I am super pissed i pay 24 dollars for some whack ass food.  I give this 2 thumbs down and some sea salt to season the food.","6793":"On July 10, 2015, my family and I were looking for a new place to eat breakfast. I found the perk-cup cafe online and thought it would be great to try a new place for breakfast. The place was pretty empty and we still waited for a seat...it took a long time for our waitress to even make an initial visit. We have two daughters and the one is two years old so things can get hectic at times. Our two year old daughter had peed herself in her pull-up diaper. The seat got wet so I quickly rushed to the bathroom and retrieved paper towels. While I cleaned the seat and placed our daughter on paper towels the waitress finally showed up and asked what we needed for drink. Meanwhile my wife said to save from any further embarrassment we should wait after we place the order to take her to the car to change her. Thinking it should be quick for the waitress to return with our drinks and to take our order we started to get uncomfortable when she took a while. Our thought was that she noticed the accident and was talking about it to the other staff. When she returned to our table it was very awkward when she rudely asked about the accident and said \"I wouldn't want to sit in that seat after that.\" Instead of asking if we needed help or even being understanding that two year olds can have accidents, she decided to make us feel terrible about the entire incident. She was more consigned about the chair than offering to assist with this embarrassing moment. The mess was cleaned off of the vinyl chair and I had placed paper towels until my wife went to the car for another pull-up diaper. I then asked for the manager and she was also the owner, at first she sided with the waitress. After hearing my side she said that she will talk to the waitress about the incident. My wife and I took vacation to relax and not experience any stressful or unnecessary drama. We are both educated professionals and also manage people for a living, after seeing so many infractions on this visit, it was determined that we will not be visiting this establishment ever again. After reading other negative  postings and one about their two year old child that had to sit on his father's lap for breakfast due to lack of service, obviously this place is not a family friendly restaurant. What a let down. We did however went to another restaurant in downtown Olmsted falls, the waitress was delighted to assist our family! She was very polite and gave attention to our kids! What a difference it was and we were generous with the a 40% gratuity tip. We are people that usually give compliments to assure good service and it takes a lot for us to give negative feedback. Please reconsider this place if you are looking for breakfast as a family with kids. Business need to realize that all the customer wants is good service and to be understood when needing assistance. I really hope the staff and owner gets training in customer service.","7726":"I've never had a bad experience at a salon, but this was just terrible. My husband saw good reviews and bought me a spa package here, but it actually left me more stressed out than when I arrived. My husband, who came with me to the spa, requested a female masseuse for me. When I was given a man, I told them this. Instead of apologizing, the man got upset with me and implied that it was our fault, by saying we must not have requested a woman. He then left me in a room, naked in a robe for at least fifteen minutes only to return to tell me I couldn't get a massage and that this was a 'deal' since they wouldn't charge me for it. So I ended up paying for a sub-par manicure and facial I never would have bought without the massage. Then after being pressed by my husband, we were told the manager would call us to resolve the issue. Nearly three weeks later, no call. Aside from all this the place was generally dirty upstairs, the receptionist didn't know how to use the system, and the employees looked unkempt. I hope others avoid the experience I had and go elsewhere to relax."},"date":{"7336":1410398586000,"11553":1510168519000,"4131":1436431051000,"11496":1513565848000,"10728":1525615390000,"3164":1485581579000,"12609":1466342346000,"6538":1527878747000,"14291":1479439758000,"2032":1437147002000,"5989":1450584774000,"1755":1361207274000,"3682":1529678900000,"6077":1530308555000,"4556":1466527933000,"7923":1170012898000,"3421":1410558927000,"13209":1407706474000,"13481":1476576865000,"1478":1486522321000,"4789":1196119021000,"6238":1395033150000,"1544":1271972170000,"2413":1516231578000,"9565":1366143234000,"2308":1423412274000,"8409":1457978650000,"769":1526331236000,"882":1514948555000,"5824":1435434432000,"13743":1473381213000,"7627":1459721403000,"10847":1367007314000,"12662":1519342979000,"13248":1405277354000,"9203":1289049349000,"1884":1424120303000,"677":1301265753000,"8810":1444704126000,"1298":1478631122000,"15051":1501128366000,"6949":1379180586000,"1589":1467512261000,"5082":1428097245000,"6932":1432572962000,"3568":1504218151000,"12667":1440770111000,"12469":1459028520000,"6793":1436945103000,"7726":1412111950000}}